<?php
/**
 * Created by PhpStorm.
 * User: kerbault
 * Date: 2019-04-03
 * Time: 15:21
 */

//╔═════════════════════════════════════════════════════════════════╗
//║ 			    	Regexes definition  						║
//╚═════════════════════════════════════════════════════════════════╝

define("RGX_REAL_NAME", '^[a-zA-Zàáâäãåąčćęèéêëėįìíîïłńòóôöõøùúûüųūÿýżźñçčšž∂ð]+\.?(([\',. -][a-zA-Zàáâäãåąčćęèéêëėįìíîïłńòóôöõøùúûüųūÿýżźñçčšž∂ð]\.?)?[a-zA-Zàáâäãåąčćęèéêëėįìíîïłńòóôöõøùúûüųūÿýżźñçčšž∂ð]*\.?)*[a-zA-Zàáâäãåąčćęèéêëėįìíîïłńòóôöõøùúûüųūÿýżźñçčšž∂ð]?\.?$');
define("RGX_USER_NAME", '^[a-zA-Z0-9]{2,50}$');
define("RGX_TAGS", '^[a-zA-Z0-9]{2,15}$');
define("RGX_PASSWD", '^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,20}$');
define("RGX_EMAIL", '^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$');